[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["friends",{"version":1,"data":{"your_info":{"in_wishlist":true,"owned":true},"in_game":[],"played_recently":[],"played_ever":[],"owns":[],"in_wishlist":[]}}],["achievementmap",{"version":4,"data":"[]"}],["usernews",{"version":4,"data":["CAkQ+fXylwYZO1DuQQEAEAEhAAAAAAAAAAApYPoOAAAAAAA=","CB4Q9/fylwYZO1DuQQEAEAEhAAAAAAAAAAApYPoOAAAAAAA="]}],["gameactivity",{"version":4,"data":[]}],["socialmedia",{"version":3,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"DreamPrimer SRL","strURL":null}],"rgPublishers":[{"strName":" Making Fun, Inc.","strURL":null}],"rgFranchises":[]}}],["releasedata",{"version":2}],["descriptions",{"version":1,"data":{"strFullDescription":"Play as a Mage, Warrior or Bounty Hunter, wielding a sword, axe, staff or gun. Level up to learn new abilities and increase your attributes.\r\n\r\nVenture into dark caves and dungeons, explore forests, villages and graveyards, lay siege to demon-controlled castles, brave snowy mountain peaks, and travel to the moon to slay strange creatures among craters and canyons, and beyond, to the deserts, pyramids and jungles of the red planet.\r\n\r\nOpen treasure chests to loot gold, gemstones and battle gear. Equip shiny breastplates, menacing helmets and hoods, spiked shoulder pads, mysterious cloaks or capes. Protect yourself with a shield, or choose to wield two weapons as a warrior.\r\n\r\nEnjoy the visceral satisfaction of responsive, fast-paced combat, with spectacular special effects, pleasing sounds, rewarding damage numbers, all set against immersive backdrops and atmospheric, inspiring music scores.\r\n\r\nEach hero class has access to about 20 abilities (skills or spells), and each of your three companions has four more. The game starts simple but culminates in a flurry of tactical possibilities at high levels.\r\n\r\nEternium is crafted with passion by a small band of old-school RPG fans, who love making the game they always wanted to play.","strSnippet":"Hack & slash against the dark forces threatening your home-world. Experience intense tactical fights in this fast paced, old school action RPG."}}]]